# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute("""SELECT firstName as First, lastName as Last FROM employees
                        JOIN offices
                        using(officeCode)
                        WHERE offices.city = "Boston";
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

   First       Last
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?

In [5]:
#Your code here
cur.execute("""SELECT officeCode FROM offices;
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  officeCode
0          1
1          2
2          3
3          4
4          5

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# -Who is da president of the entire company? 
# -List the buyprice, MSRP and quantity ordered for each productName.
# -What is the most expensive item in this database?
# -List the comments from each customer who lives in Tokyo
# -What percentage of Motorcycles sold are Harley Davidsons?

In [7]:
# Your code here
# -Who is da president of the entire company? 
cur.execute("""SELECT firstName, lastName, jobTitle, reportsTo 
                        FROM employees
                        WHERE reportsTo IS NOT NULL; """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
# df.columns = [i[0] for i in cur.description]
df.head()

         0          1                     2     3
0    Diane     Murphy             President
1     Mary  Patterson              VP Sales  1002
2     Jeff   Firrelli          VP Marketing  1002
3  William  Patterson  Sales Manager (APAC)  1056
4   Gerard     Bondur   Sale Manager (EMEA)  1056

In [8]:
# -List the buyprice, MSRP and quantity ordered for each productName.

cur.execute("""SELECT productName, buyPrice, MSRP, quantityInStock 
                        FROM PRODUCTS;
                        """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                             productName buyPrice    MSRP quantityInStock
0  1969 Harley Davidson Ultimate Chopper    48.81   95.70            7933
1               1952 Alpine Renault 1300    98.58  214.30            7305
2                  1996 Moto Guzzi 1100i    68.99  118.94            6625
3   2003 Harley-Davidson Eagle Drag Bike    91.02  193.66            5582
4                    1972 Alfa Romeo GTA    85.68  136.00            3252

In [11]:
# Your code here
# -List the buyprice, MSRP and quantity ordered for each productName.

cur.execute("""SELECT productName, buyPrice, MSRP, quantityInStock 
                        FROM PRODUCTS
                        ORDER BY buyPrice;
                        """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                                 productName buyPrice    MSRP quantityInStock
0             1998 Chrysler Plymouth Prowler   101.51  163.73            4724
1                     1962 LanciaA Delta 16V   103.42  147.74            6791
2        1958 Chevy Corvette Limited Edition    15.91   35.36            2542
3                    1982 Lamborghini Diablo    16.24   37.76            7723
4  1938 Cadillac V-16 Presidential Limousine    20.61   44.80            2847

In [14]:
# Your code here
#list comments from each customer in tokyo 

cur.execute("""SELECT comments FROM orders
                        JOIN customers
                        USING(customerNumber)
                        WHERE customers.country = 'USA';
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                                            comments
0
1
2  Customer very concerned about the exact color ...
3
4

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here
cur.execute("""SELECT firstName, lastName
                      FROM employees
                      JOIN customers 
                      US
                      GROUP BY team;""")
pd.DataFrame(cur.fetchall())

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!